# =============================================================================
# Homebrew Bundle - Package Dependencies
# =============================================================================
# Install: brew bundle --file=~/.config/Brewfile
# Update:  brew bundle dump --file=~/.config/Brewfile --force
# Generated: 2026-02-25

# =============================================================================
# Taps
# =============================================================================
tap "airbytehq/tap"
tap "alajmo/mani"
tap "anomalyco/tap"
tap "armmbed/formulae"
tap "aws/tap"
tap "charmbracelet/tap"
tap "dbt-labs/dbt"
tap "derailed/k9s"
tap "ethereum/ethereum"
tap "hashicorp/tap"
tap "heroku/brew"
tap "hidetatz/tap"
tap "janniks/git-ignore"
tap "modularml/packages"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "pipedreamhq/pd-cli"
tap "planetscale/tap"
tap "proxmark/proxmark3"
tap "rfidresearchgroup/proxmark3"
tap "snyk/tap"
tap "steipete/tap"
tap "supabase/tap"
tap "weaveworks/tap"
tap "yakitrak/yakitrak"

# =============================================================================
# Core CLI Tools
# =============================================================================
brew "bat"                    # Better cat
brew "ccat"                   # Colorized cat
brew "cheat"                  # Cheatsheets
brew "coreutils"              # GNU core utilities
brew "fd"                     # Better find
brew "fzf"                    # Fuzzy finder
brew "gping"                  # Ping with graph
brew "htop"                   # Process viewer
brew "httpie"                 # HTTP client
brew "jq"                     # JSON processor
brew "mactop"                 # macOS top
brew "ncdu"                   # Disk usage analyzer
brew "nushell"                # Modern shell
brew "pandoc"                 # Document converter
brew "ripgrep"                # Better grep
brew "rsync"
brew "telnet"
brew "tree"
brew "wget"

# =============================================================================
# Development Tools
# =============================================================================
brew "act"                    # Run GitHub Actions locally
brew "asciinema"              # Terminal recording
brew "biome"                  # JS/TS linter/formatter
brew "black"                  # Python formatter
brew "cmake"
brew "commitizen"
brew "gcc"
brew "git"
brew "git-delta"              # Better git diff
brew "git-extras"
brew "git-filter-repo"
brew "git-lfs"
brew "git-quick-stats"
brew "gitleaks"               # Secret scanning
brew "gnu-tar"
brew "gnupg"
brew "lazygit"
brew "llvm"
brew "make"
brew "mkcert"                 # Local HTTPS certs
brew "neovim"
brew "pre-commit"
brew "tmux"
brew "watchman"

# =============================================================================
# Languages & Runtimes
# =============================================================================
# Node.js
brew "fnm"                    # Fast Node Manager
brew "node"                   # Required by emscripten, gemini-cli, mongodb, snyk-cli
brew "oven-sh/bun/bun"

# Python
brew "pipx"
brew "poetry"
brew "pyenv"
brew "python-yq"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "virtualenv"

# Go
brew "go"
brew "golangci-lint"

# Rust
brew "rust"

# Scala/Java
brew "maven"
brew "openjdk"
brew "openjdk@17"
brew "scala"

# Blockchain
brew "echidna"
brew "ethereum"
brew "slither-analyzer"
brew "solidity"

# PHP
brew "php"

# =============================================================================
# Cloud & Infrastructure
# =============================================================================
# AWS
brew "awscli"
brew "aws/tap/copilot-cli"
brew "weaveworks/tap/eksctl"

# Azure
brew "azure-cli"

# GCP
cask "gcloud-cli"

# Oracle
brew "oci-cli"

# Kubernetes
brew "helm"
brew "helmfile"
brew "k3d"
brew "k6"                     # Load testing
brew "kind"
brew "kompose"
brew "kubernetes-cli"
brew "kubectx"
brew "minikube"
brew "derailed/k9s/k9s"
brew "hidetatz/tap/kubecolor"
brew "openshift-cli"

# HashiCorp
brew "hashicorp/tap/vault"
brew "tfenv"                  # Terraform version manager
cask "hashicorp/tap/hashicorp-vagrant"

# Docker & Containers
brew "docker"
brew "podman"
cask "podman-desktop"

# CI/CD
brew "argocd"
brew "circleci"

# Other Cloud
brew "doctl"                  # DigitalOcean
brew "heroku/brew/heroku"
brew "supabase/tap/supabase"
brew "planetscale/tap/pscale"

# Security
brew "checkov"
brew "dependency-check"
brew "gitleaks"
brew "snyk-cli"
brew "sysdig"
brew "trivy"
brew "zeek"
brew "proxmark/proxmark3/arm-none-eabi-gcc"
brew "proxmark/proxmark3/proxmark3", args: ["HEAD"]

# =============================================================================
# Data & Databases
# =============================================================================
brew "apache-spark"
brew "hdf5"
brew "mongodb/brew/mongodb-community"
brew "mysql-client"
brew "nifi"
brew "nsq"
brew "postgresql@15", restart_service: :changed, link: true
brew "postgresql@17", restart_service: :changed
brew "rabbitmq"

# =============================================================================
# AI & ML
# =============================================================================
brew "gemini-cli"
brew "langgraph-cli"
brew "llama.cpp"
brew "modularml/packages/modular"

# =============================================================================
# Media & Graphics
# =============================================================================
brew "ffmpeg"
brew "graphviz"
brew "hugo"
brew "poppler"
brew "scrcpy"                 # Android screen mirror
brew "tesseract"              # OCR

# =============================================================================
# Utilities
# =============================================================================
brew "airbytehq/tap/abctl"
brew "alajmo/mani/mani"
brew "ansible"
brew "bundletool"
brew "diskonaut"
brew "emscripten"
brew "mingw-w64"
brew "monit"
brew "openssh"
brew "protobuf"
brew "qemu"
brew "qt"
brew "qt@5"
brew "recode"
brew "starship"
brew "pipedreamhq/pd-cli/pipedream"
brew "yakitrak/yakitrak/obsidian-cli"

# Steipete tools
brew "anomalyco/tap/opencode"
brew "charmbracelet/tap/crush"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/peekaboo"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"

# =============================================================================
# Casks (GUI Applications)
# =============================================================================
cask "android-platform-tools"
cask "bruno"                  # API client
cask "claude-code"
cask "codex"
cask "confluent-cli"
cask "dbeaver-community"
cask "discord"
cask "ghostty"                # Terminal
cask "goland"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "lens"                   # Kubernetes IDE
cask "logitech-camera-settings"
cask "ngrok"
cask "opencode-desktop"
cask "shortcat"
cask "snowflake-snowsql"
cask "spaceman"
cask "vagrant"
cask "wireshark-chmodbpf"
cask "xquartz"

# =============================================================================
# VS Code Extensions
# =============================================================================
vscode "4ops.terraform"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.amazon-q-vscode"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "binhonglee.git-navigator"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbcode.dbcode"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "extensiontotal.extensiontotal-vscode"
vscode "f-loat.jsonl-converter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.sentinel"
vscode "hashicorp.terraform"
vscode "johnpapa.vscode-cloak"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "openai.chatgpt"
vscode "ortoni.ortoni"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "sourcegraph.amp"
vscode "steoates.autoimport"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tomoki1207.pdf"
vscode "vasubasraj.flashpost"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "zaaack.markdown-editor"
